                    # ЗАДАЧА 3.1 (ДЗ)
# Условие:
# Дана строка.
# Сначала выведите 3-ий символ этой строки.
# Во 2-ой строке выведите предпоследний символ этой строки.
# В 3-ей строке выведите первые 5 символов этой строки.
# В 4-ой строке выведите всю строку, кроме последних 2-ух символов.
# В 5-ой строке выведите все символы с чётными индексами (считая, что индексация
# начинается с 0, поэтому символы выводятся начиная с 1-ого.
# В 6-ой строке выведите все символы с нечётными индексами, т.е. начиная со 2-ого
# символа строки.
# В 7-ой строке выведите все символы в обратном порядке.
# В 8-ой строке выведите все символы строки через один в обратном порядке,
# начиная с последнего.
# В 9-ой строке выведите длину данной строки.
#
# Texto = input("Введите текст: ")
#
# print(Texto[2])                                 # 1
# print(Texto[-2])                                # 2
# print(Texto[0:5])                               # 3
# print(Texto[  : -2])                            # 4
# print(Texto[ : : 2])                            # 5
# print(Texto [1 : : 2])                          # 6
# print(Texto[ : : -1])                           # 7
# print(Texto[ -1 : : -2])                        # 8
# print(len(Texto))                               # 9

