                    # ЭКЗАМЕН 1

                    # ЗАДАНИЕ 10 (ТЕСТ)
# Условие:
# Выберите те операторы среза, которые получают каждый 3-ий символ списка s, начиная с последнего.

# s = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
#
# print(s[:0:-3])
# print(s[-1:0:-3])
# print(s[::-3])             # правильный ответ
# print(s[-1:0:3])

                    # ЗАДАНИЕ 11 (ТЕСТ)
# Условие:
# На картинке представлена программа. Что она выдаёт?

# print('$100 $200 $300'. count('$'), '$100 $200 $300'.count('$', 5, 10), '$100 $200 $300'.count('$', 5))

# 3 1 2 - ответ

                    # ЗАДАНИЕ 14 (ТЕСТ)
# Условие:
# Что будет, если вывести в консоль эту строку кода:

# print('a' + 'x' if '123'.isdigit() else 'y' + 'b')

# ax - ответ

                    # ЗАДАНИЕ 18 (ТЕСТ)
# Условие:
# Какой результат выполнения данного кода?

# for i in range(1,10):
#      i -= 5
# print(i)

# 4 - ответ

                    # ЗАДАНИЕ 20 (ТЕСТ)
# Условие:
# Какой результат выполнения данного кода?

# i = 0
# while i < 10:
#     i += 1
# i -= 10
# print(i)

# 0 - ответ

                    # ЗАДАНИЕ 23 (ТЕСТ)
# Условие:
# Что покажет этот код?

# for i in range(5):
#     if i % 2 == 0:
#         continue
#     print(i)

# 1 и 3 - ответ
